; domain
(define (domain block-words)
  (:requirements :strips :typing :equality)
  (:types block)
  (:predicates (on ?x ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y - block)
	     :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y)))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y)))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem block-words)
	(:domain block-words)
	(:objects
		k b h n s e w o t - block
	)
	(:init
		(handempty)
		(clear s)
		(on s o)
		(on o h)
		(ontable h)
		(clear k)
		(on k n)
		(ontable n)
		(clear w)
		(on w e)
		(ontable e)
		(clear b)
		(on b t)
		(ontable t)
	)
	(:goal (and
		;; know
		(clear k) (ontable w) (on k n) (on n o) (on o w)
	))
)

; plan
1. (unstack w e)
   deleted: (clear w) (handempty) (on w e)
   added: (holding w) (clear e)
   goals met: 2 of 5
2. (put-down w)
   deleted: (holding w)
   added: (clear w) (handempty) (ontable w)
   goals met: 3 of 5
3. (unstack s o)
   deleted: (clear s) (handempty) (on s o)
   added: (holding s) (clear o)
   goals met: 3 of 5
4. (put-down s)
   deleted: (holding s)
   added: (clear s) (handempty) (ontable s)
   goals met: 3 of 5
5. (unstack o h)
   deleted: (clear o) (handempty) (on o h)
   added: (holding o) (clear h)
   goals met: 3 of 5
6. (stack o w)
   deleted: (holding o) (clear w)
   added: (clear o) (handempty) (on o w)
   goals met: 4 of 5
7. (unstack k n)
   deleted: (clear k) (handempty) (on k n)
   added: (holding k) (clear n)
   goals met: 2 of 5
8. (stack k h)
   deleted: (holding k) (clear h)
   added: (clear k) (handempty) (on k h)
   goals met: 3 of 5
9. (pick-up n)
   deleted: (ontable n) (clear n) (handempty)
   added: (holding n)
   goals met: 3 of 5
10. (stack n o)
   deleted: (holding n) (clear o)
   added: (clear n) (handempty) (on n o)
   goals met: 4 of 5
11. (unstack k h)
   deleted: (clear k) (handempty) (on k h)
   added: (holding k) (clear h)
   goals met: 3 of 5
12. (stack k n)
   deleted: (holding k) (clear n)
   added: (clear k) (handempty) (on k n)
   goals met: 5 of 5
